/*!
@file BaseCamera.h
@brief カメラクラス
@copyright Copyright (c) 2022 WiZ Tamura Hiroki,Yamanoi Yasushi.
*/

#pragma once
#include "stdafx.h"

namespace basecross {
	//--------------------------------------------------------------------------------------
	///	カメラクラス
	//--------------------------------------------------------------------------------------
	class BaseCamera
	{
	protected:
		Vec3 m_eye;
		Vec3 m_at;
		Vec3 m_up;
		float m_fovY;
		float m_aspectRatio;
		float m_nearPlane;
		float m_farPlane;
		BaseCamera(const Vec3& eye, const Vec3& at);
		void ThrowIfNotSafe();
	public:
		virtual ~BaseCamera() {}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	ビュー行列を得る
		@return ビュー行列
		*/
		//--------------------------------------------------------------------------------------
		Mat4x4 GetViewMatrix();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	射影行列を得る
		@return 射影行列
		*/
		//--------------------------------------------------------------------------------------
		Mat4x4 GetProjectionMatrix();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	カメラを作成する
		@tparam	T	作成する型
		@param[in]	eye	レンズ位置
		@param[in]	at	注目位置
		@return	カメラのポインタ
		*/
		//--------------------------------------------------------------------------------------
		template <typename T>
		static shared_ptr<T>
			CreateCamera(const Vec3& eye, const Vec3& at) {
			shared_ptr<T> Ptr = shared_ptr<T>(new T(eye, at));
			auto chkPtr = dynamic_pointer_cast<BaseCamera>(Ptr);
			if (!chkPtr) {
				throw BaseException(
					L"指定のクラスはカメラに変換できません",
					L"Camera::CreateCamera()"
				);
			}
			Ptr->ThrowIfNotSafe();
			return Ptr;
		}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	レンズ位置を得る
		@return レンズ位置
		*/
		//--------------------------------------------------------------------------------------
		Vec3 GetEye() const { return m_eye; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	レンズ位置を設定する
		@param[in]	eye	レンズ位置
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetEye(const Vec3& eye) {
			m_eye = eye;
			ThrowIfNotSafe();
		}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	視点を得る
		@return 視点
		*/
		//--------------------------------------------------------------------------------------
		Vec3 GetAt() const { return m_at; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	視点を設定する
		@param[in]	at	視点
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetAt(const Vec3& at) {
			m_at = at;
			ThrowIfNotSafe();
		}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	カメラの傾きを得る
		@return カメラの傾き
		*/
		//--------------------------------------------------------------------------------------
		Vec3 GetUp() const { return m_up; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	カメラの傾きを設定する
		@param[in]	up	カメラの傾き
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetUp(const Vec3& up) {
			m_up = up;
			m_up.normalize();
		}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	画角を得る
		@return 画角
		*/
		//--------------------------------------------------------------------------------------
		float GetFovY()const { return m_fovY; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	画角を設定する
		@param[in]	fov	画角
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetFovY(float fov) { m_fovY = fov; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	縦横比を得る
		@return 縦横比
		*/
		//--------------------------------------------------------------------------------------
		float GetAspectRatio()const { return m_aspectRatio; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	縦横比を設定する
		@param[in]	ratio	縦横比
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetAspectRatio(float ratio) { m_aspectRatio = ratio; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	手前位置を得る
		@return 手前位置
		*/
		//--------------------------------------------------------------------------------------
		float GetNearPlane()const { return m_nearPlane; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	手前位置を設定する
		@param[in]	nearPlane	手前位置
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetNearPlane(float nearPlane) { m_nearPlane = nearPlane; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	奥位置を得る
		@return 奥位置
		*/
		//--------------------------------------------------------------------------------------
		float GetFarPlane()const { return m_farPlane; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	奥位置を設定する
		@param[in]	farPlane	奥位置
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetFarPlane(float farPlane) { m_farPlane = farPlane; }
		//--------------------------------------------------------------------------------------
		/*!
		@brief	更新処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnUpdate() {}
	};

}
// end namespace basecross
