/*!
@file Audio.h
@brief XAudio2を使ったオーディオクラス
@copyright WiZ Tamura Hiroki,Yamanoi Yasushi MIT License (MIT).
 MIT License URL: https://opensource.org/license/mit
*/

#pragma once

#include "stdafx.h"
namespace basecross {

	class AudioResource;

	//--------------------------------------------------------------------------------------
	///	マルチサウンドで使用するアイテム
	//--------------------------------------------------------------------------------------
	struct SoundItem {
		std::weak_ptr<AudioResource> m_AudioResource;
		IXAudio2SourceVoice* m_SourceVoice;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		SoundItem() :
			m_SourceVoice(nullptr)
		{}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		~SoundItem() {}
	};

	//--------------------------------------------------------------------------------------
	/// XAudio2マネージャクラス
	//--------------------------------------------------------------------------------------
	class XAudio2Manager : public ObjectInterface {
	public:
		//構築と破棄
		//--------------------------------------------------------------------------------------
		/*!
		@brief コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		XAudio2Manager();
		//--------------------------------------------------------------------------------------
		/*!
		@brief デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~XAudio2Manager();
		//--------------------------------------------------------------------------------------
		/*!
		@brief オーディオが有効かどうか
		@return	有効ならtrue
		*/
		//--------------------------------------------------------------------------------------
		bool IsAudioActive() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief XAudio2インターフェイスを得る
		@return	XAudio2インターフェイス
		*/
		//--------------------------------------------------------------------------------------
		ComPtr<IXAudio2> GetXAudio2() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief マスタリングボイスを得る
		@return	マスタリングボイス
		*/
		//--------------------------------------------------------------------------------------
		IXAudio2MasteringVoice* GetMasteringVoice() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief サウンドアイテムの配列を得る
		@return	サウンドアイテムの配列の参照
		*/
		//--------------------------------------------------------------------------------------
		std::vector<std::shared_ptr<SoundItem>>& GetSoundItemVec();
		const std::vector<std::shared_ptr<SoundItem>>& GetSoundItemVec() const;
		//操作
		//--------------------------------------------------------------------------------------
		/*!
		@brief	再生開始。
		@param[in]	ResKey	リソースキー
		@param[in]	LoopCount = 0	ループ回数（XAUDIO2_LOOP_INFINITEで無限ループ）
		@param[in]	Volume = 1.0f	ボリューム
		@return	SoundItemのポインタ。失敗でnullptr
		*/
		//--------------------------------------------------------------------------------------
		std::shared_ptr<SoundItem> Start(const std::wstring& ResKey, size_t LoopCount = 0, float Volume = 1.0f);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	サウンドの強制終了
		@param[in]	Item	アイテム
		@return	なし（指定のサウンドがまだ再生中なら終了させる）
		*/
		//--------------------------------------------------------------------------------------
		void Stop(const std::shared_ptr<SoundItem>& Item);
		//--------------------------------------------------------------------------------------
		/*!
		@brief OnCreate処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate()override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief OnUpdate処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnUpdate(double elapsedTime)override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	OnDraw処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnDraw() {}
	private:
		// pImplイディオム
		struct Impl;
		std::unique_ptr<Impl> pImpl;
	};



	//--------------------------------------------------------------------------------------
	///	オーディオリソース（wav）クラス
	//--------------------------------------------------------------------------------------
	class AudioResource : public ObjectInterface {
	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ<br />
		ウェブファイル名を渡す
		@param[in]	FileName	ファイル名
		*/
		//--------------------------------------------------------------------------------------
		AudioResource(const std::wstring& FileName);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~AudioResource();
		//アクセサ
		//--------------------------------------------------------------------------------------
		/*!
		@brief	サウンドデータの取得
		@return	このウェブリソースのサウンドデータ
		*/
		//--------------------------------------------------------------------------------------
		const std::vector<byte>& GetSoundData()const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	ウェブフォーマットの取得
		@return	このウェブリソースのWAVEFORMATEXウェブフォーマットのポインタ
		*/
		//--------------------------------------------------------------------------------------
		WAVEFORMATEX* GetOutputWaveFormatEx() const;

		virtual void OnCreate()override {}
		virtual void OnUpdate(double elapsedTime)override {}


	private:
		// pImplイディオム
		struct Impl;
		std::unique_ptr<Impl> pImpl;
	};



}
// end namespace basecross
