/*!
@file Particle.h
@brief 簡易エフェクトクラス
*/


#pragma once
#include "stdafx.h"

namespace basecross {

	//--------------------------------------------------------------------------------------
	///	パーティクル内の、1つのスプライトをあらわす構造体
	//--------------------------------------------------------------------------------------
	struct ParticleSprite {
		bool m_Active;				//アクティブかどうか
		bsm::Col4 m_Color;				//色（透けさせる場合はaを0にする）
		bsm::Vec2 m_LocalScale;		//ローカルスケーリング（Zは1.0固定）		
		bsm::Quat m_LocalQt;		//ローカル回転。手動のときのみ使用
		bsm::Vec3 m_LocalPos;			//ローカル位置
		bsm::Vec2 m_UVLeftTop;		//UVの左上
		bsm::Vec2 m_UVRightBottom;	//UVの右下
		bsm::Vec3 m_Velocity;			//速度(必要に応じて使用)
		ParticleSprite() :
			m_Active(true),
			m_Color(1.0f, 1.0f, 1.0f, 1.0f),
			m_LocalScale(1.0f, 1.0f),
			m_LocalQt(),
			m_LocalPos(0, 0, 0),
			m_UVLeftTop(0, 0),
			m_UVRightBottom(1.0f, 1.0f),
			m_Velocity(0, 0, 0)
		{
		}
		void Reflesh() {
			m_Active = true;
			m_Color = bsm::Col4(1.0f, 1.0f, 1.0f, 1.0f);
			m_LocalScale = bsm::Vec2(1.0f, 1.0f);
			m_LocalQt.identity();
			m_LocalPos = bsm::Vec3(0, 0, 0);
			m_UVLeftTop = bsm::Vec2(0, 0);
			m_UVRightBottom = bsm::Vec2(1.0f, 1.0f);
			m_Velocity = bsm::Vec3(0, 0, 0);
		}
	};
	class ParticleManager;
	class MultiParticle;

	//--------------------------------------------------------------------------------------
	///	パーティクル
	///	*1つのエミッターを持ち、複数のParticleSpriteを保持する
	//--------------------------------------------------------------------------------------
	class Particle : public ObjectInterface {
	public:
		enum DrawOption {
			Billboard,	//ビルボード
			Faceing,	//フェイシング
			FaceingY,	//フェイシング(Y軸のみ)
			Normal		//通常(手動)
		};
		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ
		@param[in]	Count	パーティクルの数
		@param[in]	Option	描画オプション
		*/
		//--------------------------------------------------------------------------------------
		explicit Particle(size_t Count, DrawOption Option = DrawOption::Billboard);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~Particle();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	描画オプションを得る
		@return	描画オプション
		*/
		//--------------------------------------------------------------------------------------
		DrawOption GetDrawOption()const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	描画オプションを設定する
		@param[in]	Option	描画オプション
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetDrawOption(DrawOption Option);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	アクティブかどうかを得る
		@return	1つでもアクティブがあればtrue
		*/
		//--------------------------------------------------------------------------------------
		bool IsActive() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	すべてがアクティブかどうかを得る
		@return	すべてがアクティブがあればtrue
		*/
		//--------------------------------------------------------------------------------------
		bool IsAllActive() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	すべてをアクティブに設定する
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetAllActive();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	すべてを非アクティブに設定する
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetAllNoActive();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	パーティクルを作成しなおす
		@param[in]	Count	パーティクルの数
		@param[in]	Option	描画オプション
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void Reflesh(size_t Count, Particle::DrawOption Option = Particle::DrawOption::Billboard);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	パーティクルスプライトの配列を得る
		@return	パーティクルスプライトの配列
		*/
		//--------------------------------------------------------------------------------------
		std::vector<ParticleSprite>& GetParticleSpriteVec() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	エミッター位置を得る
		@return	エミッター位置
		*/
		//--------------------------------------------------------------------------------------
		const bsm::Vec3& GetEmitterPos() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	エミッター位置を設定する
		@param[in]	Pos	エミッター位置
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetEmitterPos(const bsm::Vec3& Pos);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	トータルの時間を得る
		@return	トータルの時間
		*/
		//--------------------------------------------------------------------------------------
		float GetTotalTime() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	トータルの時間を設定する
		@param[in]	f	トータルの時間
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetTotalTime(float f);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	トータルの時間を追加する
		@param[in]	f	トータルの時間に加算する時間
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void AddTotalTime(float f);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	マックスの時間を得る
		@return	マックスの時間
		*/
		//--------------------------------------------------------------------------------------
		float GetMaxTime() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	マックスの時間を設定する
		@param[in]	f	マックスの時間
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetMaxTime(float f);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	テクスチャリソースを得る
		@param[in]	ExceptionActive	無効だった時例外を出すかどうか
		@return	テクスチャリソース
		*/
		//--------------------------------------------------------------------------------------
		std::shared_ptr<BaseTexture> GetTextureResource(bool ExceptionActive = true) const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	テクスチャリソースを設定する
		@param[in]	ResKey	テクスチャリソースキー
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetTextureResource(const std::wstring& ResKey);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	テクスチャリソースを設定する
		@param[in]	TextureResourcePtr	テクスチャリソースのポインタ
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetTextureResource(const std::shared_ptr<BaseTexture>& TextureResourcePtr);
		//操作
		//--------------------------------------------------------------------------------------
		/*!
		@brief 初期化
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate() override {}
		//--------------------------------------------------------------------------------------
		/*!
		@brief 更新処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnUpdate(double elapsedTime) override {}
		//--------------------------------------------------------------------------------------
		/*!
		@brief 描画
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void Draw(const std::shared_ptr<ParticleManager>& Manager);
	private:
		// pImplイディオム
		struct Impl;
		std::unique_ptr<Impl> pImpl;
	};

	//--------------------------------------------------------------------------------------
	///	マルチエフェクト （マルチパーティクル）
	//--------------------------------------------------------------------------------------
	class MultiParticle : public GameObject {
	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ
		@param[in]	StagePtr	ステージ
		*/
		//--------------------------------------------------------------------------------------
		explicit MultiParticle(const std::shared_ptr<Stage>& stage);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~MultiParticle();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	パーティクルの配列を得る
		@return	パーティクルの配列
		*/
		//--------------------------------------------------------------------------------------
		std::vector< std::shared_ptr<Particle> >& GetParticleVec() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	加算描画するかどうかを得る
		@return	加算描画するならtrue
		*/
		//--------------------------------------------------------------------------------------
		bool GetAddType() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	加算描画するかどうかを得る
		@return	加算描画するならtrue
		*/
		//--------------------------------------------------------------------------------------
		bool IsAddType() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	加算描画するかどうかを設定する
		@param[in]	b	加算描画するかどうか
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetAddType(bool b);
		//--------------------------------------------------------------------------------------
		/*!
		@brief 初期化前処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnPreCreate() override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief パーティクルの追加
		@param[in]	Count	パーティクルの数
		@param[in]	Option	描画オプション
		@return	追加されたパーティクル
		*/
		//--------------------------------------------------------------------------------------
		std::shared_ptr<Particle> InsertParticle(size_t Count, Particle::DrawOption Option = Particle::DrawOption::Billboard);
		//--------------------------------------------------------------------------------------
		/*!
		@brief 更新処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnUpdate(double elapsedTime)override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief 描画処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnSceneDraw(ID3D12GraphicsCommandList* pCommandList) override;
	private:
		// pImplイディオム
		struct Impl;
		std::unique_ptr<Impl> pImpl;
	};

	//--------------------------------------------------------------------------------------
	///	パーティクルマネージャ
	//--------------------------------------------------------------------------------------
	class ParticleManager : public GameObject {
	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ
		@param[in]	StagePtr	ステージ
		@param[in]	AddType	加算描画するかどうか
		*/
		//--------------------------------------------------------------------------------------
		explicit ParticleManager(const std::shared_ptr<Stage>& StagePtr, bool AddType);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~ParticleManager();
		//--------------------------------------------------------------------------------------
		/*!
		@brief 初期化処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate() override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	Zバッファを使用するかどうかを得る
		@return	Zバッファを使用するならtrue
		*/
		//--------------------------------------------------------------------------------------
		bool GetZBufferUse() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	Zバッファを使用するかどうかを得る
		@return	Zバッファを使用するならtrue
		*/
		//--------------------------------------------------------------------------------------
		bool IsZBufferUse() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	Zバッファを使用するかどうかを設定する
		@param[in]	b	Zバッファを使用するかどうか
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetZBufferUse(bool b);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	ラッピングサンプラーかどうかを得る
		@returnラッピングサンプラーならtrue
		*/
		//--------------------------------------------------------------------------------------
		bool GetSamplerWrap() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	ラッピングサンプラーかどうかを得る
		@return	ラッピングサンプラーならtrue
		*/
		//--------------------------------------------------------------------------------------
		bool IsSamplerWrap() const;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	ラッピングサンプラーを設定する
		@param[in]	b	ラッピングサンプラーにするかどうか
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void SetSamplerWrap(bool b);
		//--------------------------------------------------------------------------------------
		/*!
		@brief	描画のためのパーティクルスプライトを追加する
		@param[in]	rParticleSprite	パーティクルスプライト
		@param[in]	Option	描画オプション
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		void AddParticle(const ParticleSprite& rParticleSprite, Particle::DrawOption Option,
			const bsm::Vec3& EmitterPos, const std::shared_ptr<BaseTexture>& TextureRes);
		//--------------------------------------------------------------------------------------
		/*!
		@brief 更新処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnUpdate(double elapsedTime) override {}
		//--------------------------------------------------------------------------------------
		/*!
		@brief 描画処理
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnSceneDraw(ID3D12GraphicsCommandList* pCommandList)override;
	private:
		//Implイディオム
		struct Impl;
		std::unique_ptr<Impl> pImpl;
	};






}
// end namespace basecross

