/*!
@file BaseBlendState.h
@brief ブレンンドステートまとめ
@copyright Copyright (c) 2022 WiZ Tamura Hiroki,Yamanoi Yasushi.
*/

#pragma once

#include "stdafx.h"

namespace basecross {

	//--------------------------------------------------------------------------------------
	///	ブレンドステートクラス(static呼び出しをする)
	//--------------------------------------------------------------------------------------
	struct BaseBlendState {
		//--------------------------------------------------------------------------------------
		/*!
		@brief	塗りつぶしのブレンド定義の取得
		@return	ブレンド定義
		*/
		//--------------------------------------------------------------------------------------
		static D3D12_BLEND_DESC GetOpaqueBlend();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	単純な透明処理の取得
		@return	ブレンド定義
		*/
		//--------------------------------------------------------------------------------------
		static D3D12_BLEND_DESC GetAlphaBlend();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	半透明処理の取得
		@return	ブレンド定義
		*/
		//--------------------------------------------------------------------------------------
		static D3D12_BLEND_DESC GetAlphaBlendEx();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	加算処理の取得
		@return	ブレンド定義
		*/
		//--------------------------------------------------------------------------------------
		static D3D12_BLEND_DESC GetAdditiveBlend();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	アルファを使用した元のデータと対象データをブレンド処理の取得
		@return	ブレンド定義
		*/
		//--------------------------------------------------------------------------------------
		static D3D12_BLEND_DESC GetNonPremultipliedBlend();
		//--------------------------------------------------------------------------------------
		/*!
		@brief	アルファテスト
		@return	ブレンドステートインターフェイスのポインタ
		*/
		//--------------------------------------------------------------------------------------
		static D3D12_BLEND_DESC GetAlphaToCoverageBlend();


	};


}
// end namespace basecross
